Offwind.App/Offwind.Wpf/Templates/precursorABL/neutral/0.original/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300; 

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedGradient;
        gradient        uniform 0.003;
    }
    west
    {
        type            cyclic;
    }
    east
    {
        type            cyclic;
    }
    north
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
