Offwind.App/Offwind.Wpf/Templates/precursorABL/neutral/0.original/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
//      Note:  although we set this to slip, internal to the code this is really
//      set as a wall shear stress boundary so that we perform wall-modeled LES.
//      See Piomelli, 2002 for more about wall shear stress models.
        type            slip;
    }
    top
    {
        type            slip;
    }
    west 
    {
        type            cyclic;
    }
    east 
    {
        type            cyclic;
    }
    north 
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
